import {useState} from "react";
import './style.css'
function App() {
  const [number, setNumber] = useState(0);
  const add = (x, y) =>
  { return x + y;
  }

  const addOne = add(1, ?);
 setNumber(addOne(4));
  return (
      <div className='main'>
          <h2 className='main__text'>Студент групи ІПЗк-22-1 Петрук Олександр</h2>
          <ul className='main__list'>
              <li>Напрямок: front-end з використанням бібліотеки React.JS</li>
              <li>Для front-end розробники головним сертифікатом є його репозиторій на GitLab або GitHub але існує
                  один сертифікат для web-розробника CIW (Certified Internet Web Professional)
              </li>
          </ul>
          <p className='main__intro'>CIW - це провідна серія сертифікацій з інформаційних технологій (ІТ) у Сполучених Штатах незалежно від
              постачальника, яка створює конкретні кар’єрні шляхи ІТ для студентів і професіоналів будь-якого віку.
              Основна навчальна програма CIW зосереджена на базових стандартах і професійних навичках, які
              забезпечують функціонування Інтернету, включаючи веб-дизайн, розробку, адміністрування, роботу в мережі,
              бази даних і безпеку. CIW складається з великої серії навчальних програм і сертифікаційних іспитів із
              високими ставками, які викладають ІТ у базових і конкретних предметах кар’єрного розвитку.
              З середини 1990-х років CIW провів понад 1 мільйон курсів і отримав понад 210 000 сертифікатів. Протягом
              багатьох років сертифікації CIW отримали значне визнання в промисловості та уряді за надання необхідних
              навичок для кар’єри як у сфері ІТ, так і в управлінні. Усі наші навчальні курси включають попереднє
              оцінювання студентів, навчальні програми в нашому кампусі CIW, підручники (цифрові чи друковані) і
              повний набір онлайн-додатків, який включає відео, вікторини уроків, онлайн-вправи, практичні лабораторні
              роботи та практичні іспити; після чого проводяться спеціальні сертифікаційні іспити з високими ставками.
              Зараз CIW визнано більш ніж у 90 країнах як галузевий стандарт у галузі ІТ-освіти та сертифікації.</p>
          <p>{number}</p>
      </div>
  );
}

export default App;
